# 决斗等待时间配置（单位：秒）
DUEL_WAIT_TIME = 30  # 接受决斗等待时间
BET_WAIT_TIME = 30   # 下注等待时间

# 礼物配置
GIFTS = {
    "玩偶": {"affection": 5, "cost": 10},
    "礼服": {"affection": 10, "cost": 20},
    "歌剧门票": {"affection": 15, "cost": 30},
    "水晶球": {"affection": 20, "cost": 40},
    "耳环": {"affection": 25, "cost": 50},
    "发饰": {"affection": 30, "cost": 60},
    "小裙子": {"affection": 35, "cost": 70},
    "热牛奶": {"affection": 40, "cost": 80},
    "书": {"affection": 45, "cost": 90},
    "鲜花": {"affection": 50, "cost": 100},
}

# 道具配置
ITEMS = {
    "放大镜": {"probability": 25, "description": "查看枪膛下一发子弹"},
    "香烟": {"probability": 20, "description": "回复一点生命值"},
    "手铐": {"probability": 15, "description": "跳过对手下一回合"},
    "手锯": {"probability": 15, "description": "下一发实弹伤害+1"},
    "啤酒": {"probability": 15, "description": "退膛当前子弹"},
    "逆转器": {"probability": 5, "description": "转换当前子弹类型"},
    "肾上腺素": {"probability": 3, "description": "偷取并使用对手一个道具"},
    "过期药": {"probability": 2, "description": "50%回复2血，50%扣1血"},
    "一次性手机": {"probability": 1, "description": "随机提示弹仓某颗子弹的类型"},
}

# 爵位配置
TITLES = [
    {"name": "男爵", "reputation": 500, "max_operators": 10},
    {"name": "子爵", "reputation": 1000, "max_operators": 13},
    {"name": "伯爵", "reputation": 2000, "max_operators": 17},
    {"name": "侯爵", "reputation": 3000, "max_operators": 21},
    {"name": "公爵", "reputation": 4000, "max_operators": 25},
    {"name": "国王", "reputation": 5000, "max_operators": 30},
    {"name": "皇帝", "reputation": 7000, "max_operators": 35},
]

# 干员星级配置
OPERATOR_RARITY = {
    # 六星干员
    "能天使": 6, "银灰": 6, "艾雅法拉": 6, "安洁莉娜": 6, "星熊": 6, "推进之王": 6, "闪灵": 6, "夜莺": 6, "塞雷娅": 6, "伊芙利特": 6,
    "赫拉格": 6, "斯卡蒂": 6, "黑": 6, "煌": 6, "刻俄柏": 6, "风笛": 6, "温蒂": 6, "早露": 6, "铃兰": 6, "棘刺": 6,"森蚺": 6, "史尔特尔": 6, 
    "瑕光": 6, "泥岩": 6, "山": 6, "空弦": 6, "嵯峨": 6, "异客": 6, "凯尔希": 6, "卡涅利安": 6,"帕拉斯": 6, "水月": 6, "琴柳": 6, "远牙": 6,
    "焰尾": 6, "灵知": 6, "老鲤": 6, "澄闪": 6, "菲亚梅塔": 6, "号角": 6,"艾丽妮": 6, "流明": 6, "归溟幽灵鲨": 6, "黑键": 6, "多萝西": 6, 
    "鸿雪": 6, "玛恩纳": 6, "白铁": 6, "斥罪": 6,"重岳": 6, "林": 6,"年": 6, "令": 6, "夕": 6, "余": 6, "酒神": 6,"新约能天使": 6,"雷缪安": 6,
    "信仰搅拌机": 6,"Mon3tr": 6,"死芒": 6,"隐德来希":6,"烛煌": 6,"引星棘刺": 6,"荒芜拉普兰德": 6,"忍冬": 6,"弑君者": 6,"维娜·维多利亚": 6,"玛露西尔": 6,
    "佩佩": 6,"娜仁图亚": 6,"妮芙": 6,"乌尔比安": 6,"维什戴尔": 6,"逻各斯": 6,"魔王": 6,"阿斯卡纶": 6,"艾拉": 6,"黍": 6,"左乐": 6,"莱伊": 6,"锏": 6,
    "塑心": 6,"薇薇安娜": 6,"止颂": 6,"赫德雷": 6,"涤火杰西卡": 6,"纯烬艾雅法拉": 6,"琳琅诗怀雅": 6,"提丰": 6,"圣约送葬人": 6,"缪尔赛思": 6,"霍尔海雅": 6,
    "淬羽赫默": 6,"伊内丝": 6,"麒麟R夜刀": 6,"仇白": 6,"焰影苇草": 6,"缄默德克萨斯": 6,"伺夜": 6,"百炼嘉维尔": 6,"歌蕾蒂娅": 6,"多萝西": 6,"黑键": 6,
    "归溟幽灵鲨": 6,"耀骑士临光": 6,"假日威龙陈": 6,"浊心斯卡蒂": 6,"灰烬": 6,"迷迭香": 6,"W": 6,"傀影": 6,"阿": 6,"莫斯提马": 6,"麦哲伦": 6,"电弧": 
    6,"司霆惊蛰":6,
    
    # 五星干员
    "蒂比": 5, "Miss.Christine": 5, "聆音": 5, "阿兰娜": 5, "钼铅": 5, "水灯心": 5, "诺威尔": 5, "寻澜": 5, "行箸": 5, "特克诺": 5,
    "瑰盐": 5, "裁度": 5, "菲莱": 5, "波卜": 5, "凯瑟琳": 5, "莱欧斯": 5, "齐尔查克": 5, "森西": 5, "衡沙": 5, "莎草": 5,
    "锡人": 5, "渡桥": 5, "海霓": 5, "深巡": 5, "阿米娅(医疗)": 5, "历阵锐枪芬": 5, "阿罗玛": 5, "奥达": 5, "医生": 5, "双月": 5,
    "导火索": 5, "红隼": 5, "小满": 5, "万顷": 5, "温米": 5, "烈夏": 5, "哈洛德": 5, "深律": 5, "折光": 5, "刺玫": 5,
    "戴菲恩": 5, "杏仁": 5, "冰酿": 5, "青枳": 5, "苍苔": 5, "凛视": 5, "寒檀": 5, "空构": 5, "隐现": 5, "玫拉": 5,
    "洋灰": 5, "摩根": 5, "火龙S黑角": 5, "铎铃": 5, "火哨": 5, "截云": 5, "和弦": 5, "谜图": 5, "子月": 5, "雪绒": 5,
    "明椒": 5, "达格达": 5, "海沫": 5, "但书": 5, "晓歌": 5, "至简": 5, "承曦格雷伊": 5, "星源": 5, "濯尘芙蓉": 5, "车尔尼": 5,
    "埃拉托": 5, "掠风": 5, "洛洛": 5, "海蒂": 5, "风丸": 5, "见行者": 5, "夜半": 5, "寒芒克洛丝": 5, "九色鹿": 5, "暮落": 5,
    "极光": 5, "耶拉": 5, "蚀清": 5, "野鬃": 5, "蜜莓": 5, "灰毫": 5, "桑葚": 5, "羽毛笔": 5, "龙舌兰": 5, "绮良": 5,
    "贝娜": 5, "赤冬": 5, "熔泉": 5, "暴雨": 5, "霜华": 5, "闪击": 5, "战车": 5, "乌有": 5, "炎狱炎熔": 5, "图耶": 5,
    "爱丽丝": 5, "卡夫卡": 5, "罗宾": 5, "阿米娅(近卫)": 5, "絮雨": 5, "奥斯塔": 5, "鞭刃": 5, "四月": 5, "薄绿": 5, "燧石": 5,
    "特米米": 5, "安哲拉": 5, "贾维": 5, "蜜蜡": 5, "稀音": 5, "断崖": 5, "亚叶": 5, "莱恩哈特": 5, "苦艾": 5, "月禾": 5,
    "石棉": 5, "极境": 5, "巫恋": 5, "铸铁": 5, "慑砂": 5, "柏喙": 5, "惊蛰": 5, "哞": 5, "雪雉": 5, "灰喉": 5,
    "布洛卡": 5, "苇草": 5, "槐琥": 5, "拜松": 5, "微风": 5, "送葬人": 5, "炎客": 5, "星极": 5, "格劳克斯": 5, "锡兰": 5,
    "诗怀雅": 5, "格拉尼": 5, "夜魔": 5, "暴行": 5, "食铁兽": 5, "狮蝎": 5, "空": 5, "真理": 5, "初雪": 5, "崖心": 5,
    "守林人": 5, "普罗旺斯": 5, "火神": 5, "可颂": 5, "雷蛇": 5, "红": 5, "临光": 5, "华法琳": 5, "赫默": 5, "梅尔": 5,
    "天火": 5, "阿米娅": 5, "陨星": 5, "白金": 5, "蓝毒": 5, "幽灵鲨": 5, "拉普兰德": 5, "因陀罗": 5, "芙兰卡": 5, "德克萨斯": 5,
    "凛冬": 5, "白面鸮": 5,"录武官":5,
    
    # 四星干员
    "豆苗": 4, "红豆": 4, "清道夫": 4, "桃金娘": 4, "讯使": 4, "艾丝黛尔": 4, "缠丸": 4, "骋风": 4, "杜宾": 4, "断罪者": 4,
    "芳汀": 4, "杰克": 4, "刻刀": 4, "猎蜂": 4, "罗小黑": 4, "慕斯": 4, "石英": 4, "霜叶": 4, "休谟斯": 4, "宴": 4,
    "安比尔": 4, "白雪": 4, "红云": 4, "杰西卡": 4, "流星": 4, "梅": 4, "铅踝": 4, "松果": 4, "酸糖": 4, "跃跃": 4,
    "古米": 4, "坚雷": 4, "角峰": 4, "露托": 4, "泡泡": 4, "蛇屠箱": 4, "调香师": 4, "褐果": 4, "嘉维尔": 4, "末药": 4,
    "清流": 4, "苏苏洛": 4, "波登可": 4, "地灵": 4, "罗比蒞塔": 4, "深海色": 4, "布丁": 4, "格雷伊": 4, "卡达": 4, "深靛": 4,
    "夜烟": 4, "远山": 4, "阿消": 4, "暗索": 4, "子": 4, "砾": 4, "维荻": 4, "伊桑": 4, "云迹": 4,
    
    # 三星干员
    "芬": 3, "翎羽": 3, "香草": 3, "玫兰莎": 3, "泡普卡": 3, "月见夜": 3, "安德切尔": 3, "克洛丝": 3, "空爆": 3, "斑点": 3,
    "卡缇": 3, "米格鲁": 3, "安赛尔": 3, "芙蓉": 3, "梓兰": 3, "史都华德": 3, "炎溶": 3,
    
    # 二星干员
    "夜刀": 2, "巡林者": 2, "黑角": 2, "12F": 2, "杜林": 2,
    
    # 一星干员
    "CONFESS-47": 1, "Castle-3": 1, "泰拉大陆调查团": 1, "正义骑士号": 1, "Friston-3": 1, "Lancet-2": 1, "PhonoR-0": 1, "U-Official": 1, "THRM-EX": 1
}